## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                      |
|--------|--------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.vault_data_integrity_check_log_stream` |
|        | `aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age`   |
| update | `aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1]`                    |
|        | `aws_cloudwatch_metric_alarm.route53_ddos[1]`                                  |
|        | `aws_lambda_function.notify_slack`                                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.vault_data_integrity_check_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "vault_data_integrity_check_log_stream" {
      + destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + name            = "vault_data_integrity_check_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
      ~ dimensions                = {
          ~ "ResourceArn" = "Z05990652HOQ0SGHD81ZC" -> "Z10455362UNR7HEX7QJTL"
        }
        id                        = "DDoSDetectedRoute53Warn"
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.route53_ddos[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      ~ dimensions                = {
          ~ "ResourceArn" = "Z05990652HOQ0SGHD81ZC" -> "Z10455362UNR7HEX7QJTL"
        }
        id                        = "Route53DDoS"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age will be created
  + resource "aws_cloudwatch_metric_alarm" "vault_data_integrity_check_lambda_iterator_age" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "The Vault data integrity check lambda function is unable to keep up with the amount of events sent by the Vault DynamoDB stream"
      + alarm_name                            = "Vault data integrity check lambda iterator age"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = ""
          + "Resource"     = ""
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "IteratorAge"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 30000
      + treat_missing_data                    = "missing"
    }

  # aws_lambda_function.notify_slack will be updated in-place
  ~ resource "aws_lambda_function" "notify_slack" {
        id                             = "NotifySlack"
      ~ runtime                        = "nodejs14.x" -> "nodejs18.x"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
